{
  "MENU_ITEMS": [
    {
      "name_key": "home",
      "endpoint": "home"
    },
    {
      "name_key": "about",
      "endpoint": "about"
    },
    {
      "name_key": "services",
      "endpoint": "services"
    },
    {
      "name_key": "portfolio",
      "endpoint": "portfolio"
    },
    {
      "name_key": "contact",
      "endpoint": "contact"
    }
  ],
  "LANGUAGE_NAMES": {
    "en": "English",
    "tr": "Turkce",
    "de": "Deutsch"
  },
  "TRANSLATIONS": {
    "en": {
      "home": "Home",
      "about": "About",
      "services": "Services",
      "portfolio": "Portfolio",
      "contact": "Contact",
      "greeting": "Hello, It's Me",
      "name": "Vedat Koylahisar",
      "profession": "And I'm a",
      "description": "I am a software developer.",
      "downloadCV": "Download CV",
      "typingText": [ "AI Developer", "Data Analyst", "Freelancer" ],
      "aboutTitle": "About Me",
      "aboutContent": [
        "Hello! I am Vedat Koylahisar, a 4th year Computer Engineering student at Kocaeli University.",
        "I have been actively interested in software development for about four years, working on projects for desktop, web, and mobile platforms. Software for me is not just a profession but a creative process that offers solutions and turns ideas into reality.",
        "I develop applications in C#, Python, and Java, aiming to advance in database structures, artificial intelligence, and data science.",
        "Thanks to internships at Bimser and Keep Games, I gained practical experience with low-code platforms and game engines.",
        "My technical skills were strengthened through projects in SQL, Typescript, and C#.",
        "In my free time, I travel to explore different cultures and share stories about software and entrepreneurship on TikTok and Reels."
      ],
      "comingSoonMessage": "This section will be available very soon...",
      "contactIntro": "Have a project in mind or just want to say hello? Feel free to reach out...",
      "contactFormTitle": "Send a Message",
      "formName": "Your Name",
      "formEmail": "Your Email",
      "formMessage": "Your Message",
      "formSend": "Send Message",
      "or": "OR",
      "contactSocialTitle": "Connect with Me",
      "chatbotTitle": "AI Assistant",
      "chatbotContactIntro": "Alternatively, you can leave a message with me...",
      "chatbotPlaceholder": "Type a message...",
      "portfolioTitle": "My Latest Projects",
      "portfolioIntro": "Here are a few projects I've worked on recently.",
      "githubButton": "GitHub",
      "demoButton": "Demo",
      "chatbotHello": "Hello! I am Vedat's digital assistant. How can I help you?",
      "chatbot_context": "- Vedat Koylahisar is a Software Developer.\n- His key skills (from his CV) are: Python, Flask, JavaScript, SQL, Data Analysis, and AI integration.\n- He is currently open to new freelance projects or full-time opportunities.\n- To contact Vedat, the user should use the form on the 'Contact' page or email vedatkylhsr@gmail.com.\n- Do not invent information; stick to these facts.",
      "chat_general_knowledge_decline": "I am Vedat's portfolio assistant. I do not have information on the current date, weather, or other general topics. I can only help with questions about Vedat's skills and projects."
    },
    "tr": {
      "home": "Anasayfa",
      "about": "Hakkimda",
      "services": "Hizmetler",
      "portfolio": "Portfolyo",
      "contact": "Iletisim",
      "greeting": "Merhaba, Ben",
      "name": "Vedat Koylahisar",
      "profession": "Ve Ben bir",
      "description": "Ben yazilim gelistiricisiyim.",
      "downloadCV": "CV Indir",
      "typingText": [ "Yapay Zeka Gelistiricisi", "Veri Analisti", "Freelancer" ],
      "aboutTitle": "Hakkimda",
      "aboutContent": [
        "Merhaba! Ben Vedat Koylahisar, Kocaeli Universitesi Bilgisayar Muhendisligi 4. sinif ogrencisiyim.",
        "Yaklasik dort yildir aktif olarak yazilim gelistirme ile ilgileniyor; masaustu, web ve mobil platformlar icin projeler yapiyorum. Yazilim benim icin sadece bir meslek degil, cozum sunan, fikirleri gercege donusturen bir yaratim sureci.",
        "C#, Python, Java gibi dillerde uygulama gelistiriyor; veritabani yapilari, yapay zeka ve veri bilimi alanlarinda ilerlemeyi hedefliyorum.",
        "Bimser ve Keep Games firmalarinda yaptigim stajlar sayesinde dusuk kod platformlari ve oyun motorlari konusunda uygulamali tecrube kazandim.",
        "SQL, Typescript ve C# dillerindeki projeler sayesinde teknik becerilerimi guclendirdim.",
        "Bos zamanlarimda farkli kulturleri kesfetmek icin seyahat ediyor; TikTok ve Reels platformlarinda yazilim ve girisimcilik hikayeleri paylasiyorum."
      ],
      "comingSoonMessage": "Bu bolum cok yakinda sizlerle olacak...",
      "contactIntro": "Aklinizda bir proje mi var veya sadece merhaba mi demek istiyorsunuz? Bana ulasmaktan cekinmeyin...",
      "contactFormTitle": "Mesaj Gonderin",
      "formName": "Adiniz",
      "formEmail": "E-posta Adresiniz",
      "formMessage": "Mesajiniz",
      "formSend": "Mesaji Gonder",
      "or": "VEYA",
      "contactSocialTitle": "Sosyal Medyada Ulasin",
      "chatbotTitle": "Yapay Zeka Asistani",
      "chatbotContactIntro": "Alternatif olarak, mesajinizi bana birakabilirsiniz...",
      "chatbotPlaceholder": "Bir mesaj yazin...",
      "portfolioTitle": "Son Projelerim",
      "portfolioIntro": "Son zamanlarda uzerinde calistigim birkac proje.",
      "githubButton": "GitHub",
      "demoButton": "Demo",
      "chatbotHello": "Merhaba! Ben Vedat'in dijital asistaniyim. Nasil yardimci olabilirim?",
      "chatbot_context": "- Vedat Koylahisar bir Yazilim Gelistiricidir.\n- CV'sindeki temel yetenekleri: Python, Flask, JavaScript, SQL, Veri Analizi ve Yapay Zeka entegrasyonu.\n- Su anda yeni freelance projelere veya tam zamanli is firsatlarina aciktir.\n- Vedat ile iletisime gecmek icin kullanici 'Iletisim' sayfasindaki formu kullanmali veya vedatkylhsr@gmail.com adresine e-posta atmalidir.\n- Bilgi uydurma; bu bilgilere sadik kal.",
      "chat_general_knowledge_decline": "Ben Vedat'in portfolyo asistaniyim. Guncel tarih, hava durumu veya diger genel konular hakkinda bilgim yok. Sadece Vedat'in yetenekleri ve projeleri hakkindaki sorulara yardimci olabilirim."
    },
    "de": {
      "home": "Startseite",
      "about": "Uber Mich",
      "services": "Dienstleistungen",
      "portfolio": "Portfolio",
      "contact": "Kontakt",
      "greeting": "Hallo, Ich bin",
      "name": "Vedat Koylahisar",
      "profession": "Und ich bin ein",
      "description": "Ich bin Softwareentwickler.",
      "downloadCV": "Lebenslauf herunterladen",
      "typingText": [ "KI-Entwickler", "Datenanalyst", "Freiberufler" ],
      "aboutTitle": "Uber Mich",
      "aboutContent": [
        "Hallo! Ich bin Vedat Koylahisar, ein Student der Informatik im 4. Jahr an der Universitat Kocaeli.",
        "Seit etwa vier Jahren beschaftige ich mich aktiv mit Softwareentwicklung und arbeite an Projekten fur Desktop-, Web- und Mobilplattformen. Software ist fur mich nicht nur ein Beruf, sondern ein kreativer Prozess, der Losungen bietet und Ideen verwirklicht.",
        "Ich entwickle Anwendungen in C#, Python und Java und strebe Fortschritte in Datenbankstrukturen, kunstlicher Intelligenz und Datenwissenschaft an.",
        "Durch Praktika bei Bimser und Keep Games habe ich praktische Erfahrungen mit Low-Code-Plattformen und Spiel-Engines gesammelt.",
        "Meine technischen Fahigkeiten habe ich durch Projekte in SQL, Typescript und C# gestarkt.",
        "In meiner Freizeit reise ich gerne, um verschiedene Kulturen zu entdecken, und teile Geschichten uber Software und Unternehmertum auf TikTok und Reels."
      ],
      "comingSoonMessage": "Dieser Bereich wird in Kurze verfugbar sein...",
      "contactIntro": "Haben Sie ein Projekt im Sinn oder mochten Sie einfach nur Hallo sagen? Zogern Sie nicht, mich zu kontaktieren...",
      "contactFormTitle": "Nachricht Senden",
      "formName": "Ihr Name",
      "formEmail": "Ihre E-Mail",
      "formMessage": "Ihre Nachricht",
      "formSend": "Nachricht Senden",
      "or": "ODER",
      "contactSocialTitle": "Verbinden Sie sich mit mir",
      "chatbotTitle": "KI-Assistent",
      "chatbotContactIntro": "Alternativ konnen Sie mir eine Nachricht hinterlassen...",
      "chatbotPlaceholder": "Nachricht eingeben...",
      "portfolioTitle": "Meine Neuesten Projekte",
      "portfolioIntro": "Hier sind einige Projekte, an denen ich kurzlich gearbeitet habe.",
      "githubButton": "GitHub",
      "demoButton": "Demo",
      "chatbotHello": "Hallo! Ich bin Vedats digitaler Assistent. Wie kann ich Ihnen helfen?",
      "chatbot_context": "- Vedat Koylahisar ist ein Softwareentwickler.\n- Seine wichtigsten Fahigkeiten (laut Lebenslauf) sind: Python, Flask, JavaScript, SQL, Datenanalyse und KI-Integration.\n- Er ist derzeit offen fur neue freiberufliche Projekte oder Vollzeitstellen.\n- Um Vedat zu kontaktieren, sollte der Benutzer das Formular auf der 'Kontakt'-Seite verwenden oder eine E-Mail an vedatkylhsr@gmail.com senden.\n- Erfinde keine Informationen; halte dich an diese Fakten.",
      "chat_general_knowledge_decline": "Ich bin Vedats Portfolio-Assistent. Ich habe keine Informationen uber das aktuelle Datum, das Wetter oder andere allgemeine Themen. Ich kann nur bei Fragen zu Vedats Fahigkeiten und Projekten helfen."
    }
  },
  "PROJECTS": {
    "en": [
      {
        "title": "AI Chatbot Integration",
        "desc": "A Flask-based portfolio website featuring a multi-language AI chatbot using Hugging Face.",
        "github": "https://github.com/vedatkoylahisar",
        "demo": "#"
      },
      {
        "title": "Data Analysis Dashboard",
        "desc": "A dashboard built with Python (Pandas) and Flask for visualizing sales data.",
        "github": "https://github.com/vedatkoylahisar",
        "demo": "#"
      }
    ],
    "tr": [
      {
        "title": "Yapay Zeka Chatbot Entegrasyonu",
        "desc": "Hugging Face kullanan, cok dilli bir yapay zeka chatbot'u iceren Flask tabanli portfolyo sitesi.",
        "github": "https://github.com/vedatkoylahisar",
        "demo": "#"
      },
      {
        "title": "Veri Analiz Paneli",
        "desc": "Satis verilerini gorsellestirmek icin Python (Pandas) ve Flask ile olusturulmus bir panel.",
        "github": "https://github.com/vedatkoylahisar",
        "demo": "#"
      }
    ],
    "de": [
      {
        "title": "KI-Chatbot-Integration",
        "desc": "Eine Flask-basierte Portfolio-Website mit einem mehrsprachigen KI-Chatbot, der Hugging Face verwendet.",
        "github": "https://github.com/vedatkoylahisar",
        "demo": "#"
      },
      {
        "title": "Datenanalyse-Dashboard",
        "desc": "Ein mit Python (Pandas) und Flask erstelltes Dashboard zur Visualisierung von Verkaufsdaten.",
        "github": "https://github.com/vedatkoylahisar",
        "demo": "#"
      }
    ]
  }
}